export interface DefenderConfig {
  地块等级: number;
  守军兵力: number;
  部队数量: number;
  单部队武将数量: number;
  武将等级: number;
  武将兵力: number;
  战斗胜利总经验: number;
}

export const defendersData: DefenderConfig[] = [
  {
      "地块等级": 1,
      "守军兵力": 300,
      "部队数量": 1,
      "单部队武将数量": 3,
      "武将等级": 1,
      "武将兵力": 100,
      "战斗胜利总经验": 150
  },
  {
      "地块等级": 2,
      "守军兵力": 600,
      "部队数量": 1,
      "单部队武将数量": 3,
      "武将等级": 2,
      "武将兵力": 200,
      "战斗胜利总经验": 450
  },
  {
      "地块等级": 3,
      "守军兵力": 1500,
      "部队数量": 1,
      "单部队武将数量": 3,
      "武将等级": 5,
      "武将兵力": 500,
      "战斗胜利总经验": 1500
  },
  {
      "地块等级": 4,
      "守军兵力": 3600,
      "部队数量": 1,
      "单部队武将数量": 3,
      "武将等级": 12,
      "武将兵力": 1200,
      "战斗胜利总经验": 4500
  },
  {
      "地块等级": 5,
      "守军兵力": 6000,
      "部队数量": 1,
      "单部队武将数量": 3,
      "武将等级": 20,
      "武将兵力": 2000,
      "战斗胜利总经验": 15000
  },
  {
      "地块等级": 6,
      "守军兵力": 8400,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 28,
      "武将兵力": 2800,
      "战斗胜利总经验": 35000
  },
  {
      "地块等级": 7,
      "守军兵力": 10500,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 35,
      "武将兵力": 3500,
      "战斗胜利总经验": 80000
  },
  {
      "地块等级": 8,
      "守军兵力": 12000,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 40,
      "武将兵力": 4000,
      "战斗胜利总经验": 180000
  },
  {
      "地块等级": 9,
      "守军兵力": 13500,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 45,
      "武将兵力": 4500,
      "战斗胜利总经验": 400000
  },
  {
      "地块等级": 10,
      "守军兵力": 15000,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 50,
      "武将兵力": 5000,
      "战斗胜利总经验": 600000
  },
  {
      "地块等级": 11,
      "守军兵力": 40500,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 50,
      "武将兵力": 13500,
      "战斗胜利总经验": 800000
  },
  {
      "地块等级": 12,
      "守军兵力": 45000,
      "部队数量": 2,
      "单部队武将数量": 3,
      "武将等级": 50,
      "武将兵力": 15000,
      "战斗胜利总经验": 1000000
  }
];
